import markups as m


im_fo = "src"  # stands for image folder

data = {
    "На головну": [
        "<b>Вас вітає чат-бот</b>\n"
        "<b>НУ “ОЮА”\n\n</b>"
        "   Привіт!\n"
        "   Вітаємо тебе у чат-боті Національного університету «Одеська юридична академія».\n"
        "   НУ «ОЮА» - це стабільно висока якість освіти і затребуваність випускників на ринку праці, це визнаний "
        "міжнародний авторитет і великі академічні зв\"язки з кращими вишами світу.\n"
        "   Наш університет динамічно розвивається і вдосконалюється, ми впроваджуємо в освітню діяльність новітні"
        " технології, щоб відповідати постійно зростаючим стандартам освіти.\n"
        "   Ми створили цей чат-бот для зручності наших студентів, а також для того, щоб ти зміг переконатись "
        "особисто, що ми кращі, та побачити Національний університет «Одеська юридична академія» з середини.\n"
        "   Для початку тобі потрібно лише обрати, що саме тебе цікавить:\n"
        "   -умови вступу;\n"
        "   -екскурсія університетом;\n"
        "   -інформація студенту;\n"
        "   -контакти.\n",

        m.welcome,
        [f"{im_fo}\\coa_nuola.jpg"]
    ],
    "Екскурсія університетом": [
        "<b>Екскурсія університетом</b>",

        m.excursion,
        [f"{im_fo}/DJI_0008.jpg"]
    ],
    "Контакти": [
        "https://onua.edu.ua/ua/contact-footer-ukr",

        m.welcome,
        []
    ],
    "Навчальні корпуси": [
        "   НУ «ОЮА» має кращу матеріально-технічну базу в країні!\n"
        "   В розпорядженні університету є декілька навчальних корпусів на вулиці Академічній,"
        "а також у центрі міста на вулиці Рішельєвській.\n"
        "   Заняття кожного факультету проходять у їх особистому корпусі, кожен з який має кафе для зручності"
        " студентів та постійну охорону.",

        m.ed_facilities,
        []

    ],
    # No info
    "Фонтанська, 23": [
        "<b>Фонтанська, 23</b>",

        m.to_ed_facilities,
        []
    ],
    "Академічна, 2": [
        "<b>Академічна, 2</b>",

        m.akademichna_2,
        []
        # Add photo DSC_0706.jpg
    ],
    "МПО": [
        "https://onua.edu.ua/ua/o-nas-mpv-ukr",

        m.to_ed_facilities,
        []
    ],
    "САФ": [
        "https://onua.edu.ua/ua/about-saf-ukr",

        m.to_ed_facilities,
        []
    ],
    "ФПС": [
        "https://onua.edu.ua/ua/about-fps-ukr",

        m.to_ed_facilities,
        []
    ],
    "ФППС": [
        "https://onua.edu.ua/ua/about-fpps-ukr",

        m.to_ed_facilities,
        []
    ],
    # No info
    "Академічна, 5": [
        "<b>Академічна, 5</b>",

        m.akademichna_5,
        []
    ],
    "Центр заочного та дистанційного навчання": [
        "https://onua.edu.ua/ua/about-czdn-ukr",

        m.to_ed_facilities,
        []
    ],
    "Академічна, 7": [
        # No info
        "<b>Академічна, 7/<b>",

        m.akademichna_7,
        []
    ],
    "ФЖ": [
        "https://onua.edu.ua/ua/about-cgu-ukr",

        m.to_ed_facilities,
        []
    ],
    "Академічна, 9": [
        # No info
        "<b>Академічна, 9</b>",

        m.akademichna_9,
        []
    ],
    "ЦГЮ": [
        "https://onua.edu.ua/ua/about-cgu-ukr",

        m.to_ed_facilities,
        []
    ],
    "Центр підготовки магістрів": [
        "https://onua.edu.ua/ua/about-mds-ukr",

        m.to_ed_facilities,
        []
    ],
    "Рішельевська, 28": [
        # No info
        "<b>Рішельевська, 28</b>",
        m.rishelevska_28,
        []
    ],
    "СПФ": [
        "https://onua.edu.ua/ua/about-spf-ukr",

        m.to_ed_facilities,
        []
    ],
    "ФА": [
        "https://onua.edu.ua/ua/o-fa-ukr",

        m.to_ed_facilities,
        []
    ],
    "ФКІТ": [
        "https://onua.edu.ua/ua/pro-fakultet-informatsiinykh-tekhnolohii-ta-kiberbezpeky",

        m.to_ed_facilities,
        []
    ],
    "Кленова, 8": [
        # No info
        "<b>Кленова, 8</b>",

        m.to_ed_facilities,
        []
    ],
    "Гуртожитки": [
        "<b>Гуртожитки</b>\n\n"
        "   Гуртожитки обладнанні всім необхідним для комфортного проживання студентів: в кожній кімнаті є окремий" 
        " санвузол з душовою кабінкою, холодильник, всі необхідні меблі.\n" 
        "   До того ж, адміністрація університету постійно працює над модернізацією та оновленням" 
        "матеріально-технічної бази, намагаючись зробити умови проживання студентів більш комфортними.\n" 
        "   Який гуртожиток ти хочеш оглянути?",

        m.dormitory,
        []
    ],
    # Femida
    "Гуртожиток №1": [
        "<b>Гуртожиток № 1 «Феміда»</b>\n"
        "Знаходиться за адресою вул. Академічна, 8",

        m.to_dormitory,
        []  # No Photos
    ],
    # Yurist
    "Гуртожиток №2": [
        "<b>Гуртожиток №2 «Юрист»</b>\n"
        "Знаходиться за адресою вул. Тополева, 8",

        m.to_dormitory,
        [f"{im_fo}/Юрист1.jpg", f"{im_fo}/Юрист2.jpg",
         f"{im_fo}/Юрист4.jpg", f"{im_fo}/Юрист5.jpg"]
    ],
    # Mirniy
    "Гуртожиток №3": [
        "<b>Гуртожиток №3 «Мирний» (</b>\n"
        "Знаходиться за адресою вул. Фонтанська дорога, 71",

        m.to_dormitory,
        []
        # No Photos
    ],
    # Uspenka
    "Гуртожиток №4": [
        "<b>Гуртожиток №4  «Екіпаж»</b>\n"
        "Знаходиться за адресою вул Успенська 28/30",

        m.to_dormitory,
        []  # No Photos
    ],
    # Leks
    "Гуртожиток №5": [
        "<b>Гуртожиток №5 «Лекс»</b>\n"
        "Знаходиться за адресою вул. Льва Толстого, 24",

        m.to_dormitory,
        []  # No Photos
    ],
    # Gen Petrova
    "Гуртожиток №6": [
        "<b>Гуртожиток №6</b>\n"
        "Знаходиться за адресою вул. Ген. Петрова, 18",

        m.to_dormitory,
        []  # No Photos
    ],
    # MBM
    "Гуртожиток №9": [
        "<b>Гуртожиток №9»</b>\n"
        "Знаходиться за адресою вул. Академічна, 30",

        m.to_dormitory,
        [f"{im_fo}/МБМ.jpg"]
    ],

    "Спортивна база": [
        "<b>Спортивна база</b>\n\n"
        "   Національний університет «Одеська юридична академія» має в своєму розпорядженні сучасні спортивні " 
        "стадіони, тренажерні і танцювальні зали.\n" 
        "   При НУ «ОЮА» створений Центр спортивних єдиноборств, зі стін якого виходять чемпіони по дзюдо, " 
        "самбо, панкратіону, грепплінгу, сумо, боротьбі на поясах.\n" 
        "   Справжня гордість університету - ультрасучасний, мультифункціональний спортивний комплекс," 
        " розташований на самому березі моря, передбачений для занять фізичною культурою і проведення змагань з " 
        "найрізноманітніших видів спорту. Літні і зимові спортивні майданчики, тенісні корти і тренажерні зали" 
        "дозволяють з комфортом займатися спортом в будь-який час року і в будь-яку погоду.",

        m.sport_base,
        []
    ],
    "Стадіон": [
        "<b>Стадіон</b>",

        m.sport_base_back,
        [f"{im_fo}/cпорт22.jpg", f"{im_fo}/cтадион.jpg"],
    ],
    "Тренажерна зала": [
        "<b>Тренажерна Зала</b>",

        m.sport_base_back,
        [f"{im_fo}/тренажеры.jpg"]
    ],
    "8-ма Фонтану": [
        "<b>8-ма Фонтану</b>",

        m.sport_base_back,
        [f"{im_fo}/_DSC3691.jpg", f"{im_fo}/_DSC3703.jpg", f"{im_fo}/_DSC3721.jpg"]
    ],
    "Тенісна зала": [
        "<b>Тенісна Зала</b>",

        m.sport_base_back,
        [f"{im_fo}/теннисный зал 2.jpg"]
    ],
    "Кампус": [
        "<b>Матеріально-технічна база</b>\n\n"
        "   Можна без перебільшення сказати, що матеріально-технічна база в НУ “ОЮА” не має рівних в Україні.\n"
        "   Так, в стінах університету було відкрито Центр тестування на поліграфі, в якому сертифіковані "
        "поліграфологи навчають майбутніх слідчих особливостям роботи з «Детектором брехні». Є в вузі зал судових "
        "засідань. Крім того, до послуг студентів - спеціалізована аудиторія «Автоматизоване місце слідчого, "
        "прокурора, детектива», музей вогнепальної і холодної зброї, а також пневматичний і вогнепальний "
        "стрілецькі тири.\n"
        "   Гордість університету - наукова бібліотека НУ «ОЮА. Це унікальний науковий центр праць сучасних "
        "вчених-правознавців, оснащений за всіма європейськими стандартами.\n"
        "   Неможливо не сказати про те, що перлиною університету і гордістю його колективу є відділ рідкісних "
        "видань наукової бібліотеки Музей рідкісної книги.",

        m.mt_base,
        []
    ],
    "Музей рідкісної книги": [
        "<b>Музей рідкісної книги</b>\n\n" 
        "   Перлиною університету і гордістю його колективу є відділ рідкісних видань наукової бібліотеки " 
        "Музей рідкісної книги. У спеціально відведеному і обладнаному приміщенні використана система «відкритого" 
        " зберігання» фонду рідкісних видань, яка налічує понад 12 000 примірників.",

        m.to_mt_base,
        [f"{im_fo}/музей редкой книги.jpg"],
    ],
    "IT-центр": [
        "<b>IT-центр Комп’ютерний дім</b>",

        m.to_mt_base,
        [f"{im_fo}/ІТ.jpg", f"{im_fo}/DSC_9434.jpg", f"{im_fo}/ІТ1.jpg"]
    ],
    "Наукова бібліотека": [
        "<b>Матеріально-технічна база</b>\n\n" 
        "   Можна без перебільшення сказати, що матеріально-технічна база в НУ “ОЮА” не має рівних в Україні.\n" 
        "   Так, в стінах університету було відкрито Центр тестування на поліграфі, в якому сертифіковані " 
        "поліграфологи навчають майбутніх слідчих особливостям роботи з «Детектором брехні». Є в вузі зал " 
        "судових засідань. Крім того, до послуг студентів - спеціалізована аудиторія «Автоматизоване місце" 
        " слідчого, прокурора, детектива», музей вогнепальної і холодної зброї, а також пневматичний" 
        " і вогнепальний стрілецькі тири.\n" 
        "   Гордість університету - наукова бібліотека НУ «ОЮА. Це унікальний науковий центр праць сучасних " 
        "вчених-правознавців, оснащений за всіма європейськими стандартами." 
        " Неможливо не сказати про те, що перлиною університету і гордістю його колективу є відділ рідкісних " 
        "видань наукової бібліотеки Музей рідкісної книги.",

        m.to_mt_base,
        [f"{im_fo}/абонемент.jpg", f"{im_fo}/читальный зал.jpg"]
    ],
    "Тир та Музей зброї": [
        "<b>Тир</b>\n\n" 
        "   До послуг студентів музей вогнепальної і холодної зброї, а також пневматичний і вогнепальний " 
        "стрілецькі тири, де майбутні працівники правоохоронних органів відточують свою майстерність " 
        "поводження зі зброєю.\n" 
        "   Студенти НУ «ОЮА» займаються в стрілецькому тирі вивчаючи застосування зброї, бойову підготовку.",

        m.to_mt_base,
        [f"{im_fo}/тир пневматика.jpg", f"{im_fo}/боеврй тир 1.jpg", f"{im_fo}/Музей оружия.jpg"]
    ],
    "Кафе «Лекс»": [
        "<b>Кафе \"ЛЕКС\"</b>\n\n" 
        "   В університеті і його підрозділах функціонують кафе, де для учнів готують і смачну, і, що не менш важливо, "
        "здорову їжу. Ціни в кафе приємно радують своєю демократичністю.",

        m.to_mt_base,
        [f"{im_fo}/Лекс 1.jpg", f"{im_fo}/Лекс 2.jpg"]

    ],
    "Поліграф": [
        "<b>Поліграф</b>\n\n"
        "   У стінах університету створено Центр тестування на поліграфі оснащений п\"ятиканальним " 
        "поліграфом останньої моделі, в якому сертифіковані поліграфологи навчають майбутніх детективів " 
        "особливостям роботи з «Детектором брехні».\n" 
        "   Застосування перевірки на поліграфі в наш час, стало дуже частим превентивним методом безпеки на"
        " підприємствах при прийомі на роботу нового співробітника, запобігання протиправних діянь з боку " 
        "співробітників, а також є інструментом підвищення дисципліни в колективі, в тому числі розслідування " 
        "конкретних випадків неправомірних дій матеріально-відповідальних осіб, спірних ситуацій, витоку " 
        "інформації і т.д.",

        m.to_mt_base,
        [f"{im_fo}/DSC_9666.jpg"]
        # Add image IMG_4754.jpg
    ],
    "Актова зала": [
        "<b>Актова Зала</b>\n\n" 
        "   Творчий і культурний розвиток особистості - невід\"ємний елемент освітнього процесу. Саме з цією "
        "метою в університеті створено усі умови, щоб студенти могли проявити свої приховані таланти - " 
        "акторські, вокальні, танцювальні. Університетські свята супроводжуються яскравими концертами і флешмобами" 
        " силами студентів.",

        m.to_mt_base,
        [f"{im_fo}/DSC_0757.jpg"]
        # Add image IMG_0800.jpg
    ],
    "Структурні підрозділи": [
        "<b>Актова Зала</b>\n\n" 
        "   Національній університет «Одеська юридична академія» реалізує унікальний проект «Академічна " 
        "мобільність» всередині України. Університет має структурні підрозділи за межами Одеси в шести" 
        " містах нашої країни: Києві, Івано-Франківську, Миколаєві, Черкасах, Чернівцях, Кривому Розі.\n" 
        "   Тобто, без переїзду, у себе на місці студенти можуть вчитися і отримати престижний диплом " 
        "Національного університету «Одеська юридична академія». І цей проект реально працює і включає " 
        "інші можливості для студентів.\n" 
        "   Яке місто тебе цікавить?",

        m.facilities,
        [f"{im_fo}/карта.jpg"]
    ],
    "Одеса": [
        "Юридичний коледж\nhttps://onua.edu.ua/ua/jur-coll-ua\n\n" 
        "Училище №3\nhttps://onua.edu.ua/ua/pro-uchylyshche\n\n" 
        "Училище сфери послуг\nhttps://onua.edu.ua/ua/about-ovptu-ukr",
        m.to_facilities,
        []
    ],
    "Киів": [
        "<b>Київ</b>\n\n" 
        "Київський інститут інтелектуальної власності та права\n" 
        "https://onua.edu.ua/ua/about-kiev-institut-ukr\n\n" 
        "Коледж Київського інституту\nhttps://onua.edu.ua/ua/about-kiev-coll-ukr",

        m.to_facilities,
        []
    ],
    "Чернівці": [
        "<b>Чернівці</b>\n\n" 
        "Чернівецький юридичний інститут\nhttps://onua.edu.ua/ua/about-ch-yu-i-ukr\n\n" 
        "Чернівецький юридичний коледж\nhttps://onua.edu.ua/ua/aboet-chern-coll-ukr",

        m.to_facilities,
        []
    ],
    "Івано-Франківськ": [
        "<b>Івано-Франківськ</b>\n\n" 
        "Івано-Франківський юридичний інститут\nhttps://onua.edu.ua/ua/o-nas-ivano-frankovsk-ukr\n\n" 
        "Івано-Франківський юридичний коледж\nhttps://onua.edu.ua/ua/pro-ivano-frankivskyi-iurydychnyi-koledzh",

        m.to_facilities,
        []
    ],
    "Миколаїв": [
        "<b>Миколаїв</b>\n\n" 
        "Миколаївський інститут права\nhttps://onua.edu.ua/ua/about-mip-ukr\n\n"
        "Миколаївський юридичний коледж\nhttps://onua.edu.ua/ua/o-nas-muk-ukr",

        m.to_facilities,
        []
    ],
    "Кривий Ріг": [
        "<b>Кривий Ріг</b>\n\n" 
        "Криворізький факультет\nhttps://onua.edu.ua/ua/about-kr-faculty-ukr\n\n" 
        "Криворізький юридичний коледж\nhttps://onua.edu.ua/ua/about-kr-coll-ukr",

        m.to_facilities,
        []
    ],
    "Черкаси": [
        "<b>Черкаси</b>\n\n"
        "Черкаський факультет\nhttps://onua.edu.ua/ua/about-cherk-faculty-ukr",

        m.to_facilities,
        []
    ],
    "Знайти аудиторію": [
        "   Для пошуку аудиторії напиши її номер, наприклад: \"№302\"."
        "   Таким чином ти дізнаешся у якому корпусі вона знаходиться!",

        m.class_search,
        []
    ],
    "Студенту": [
        # No info
        "<b>Студенту</b>",

        m.for_student,
        []
    ],
    "Розклад занять": [
        "   Ознайомитись з розкладом можна за наступним посиланням:"
        "\n   http://onua.edu.ua/ua/studentu-ua/raspisanie",

        m.to_for_student,
        []
    ],
    "Знайти кафедру": [
        "<b>Кафедри університету</b>",

        m.for_student,
        [f"{im_fo}/розклад.jpg"]
    ],
    "Умови вступу": [
        "<b>   Для вступу на перший курс університету до приймальної комісії подаються такі документи:</b>\n"
        "   заява встановленого зразка\n"
        "<b>   До заяви, поданої в паперовій формі, вступник додає:</b>\n"
        "   копію документа, що посвідчує особу;\n"
        "   військово-облікового документа для військовозобов’язаних (крім випадків, передбачених законодавством);\n"
        "   копію документа державного зразка про загальну середню освіту і копію додатка до нього;\n"
        "   копію сертифіката (сертифікатів) зовнішнього незалежного оцінювання;\n"
        "   чотири кольорові фотокартки розміром 3 х 4 см;\n"
        "   копії документів, що засвідчують спеціальні умови особи на участь у конкурсному відборі при"
        " вступі для здобуття вищої освіти на основі повної загальної середньої освіти, подаються вступником особисто "
        "при поданні документів у паперовій формі у визначені терміни.\n"
        "   Інші копії документів подаються вступником, якщо це виклика- но особливими умовами вступу на відповідні"
        " конкурсні пропозиції, установлені законодавством, у строки, визначені для прийому до- кументів.\n"
        "<b>   Під час подання заяви в паперовій формі вступник пред’являє особисто оригінали:</b>\n"
        "   документа, що посвідчує особу;\n"
        "   військово-облікового документа для військовозобов’язаних (крім випадків, передбачених законодавством);\n"
        "   документа державного зразка про загальну середню освіту (оригінал) і додатка до нього;\n"
        "   сертифіката (сертифікатів) зовнішнього незалежного оцінювання\n"
        "   документів, які підтверджують право вступника на участь у конкурсі за результатами вступних "
        "іспитів на основі повної загальної середньої освіти, зарахування за співбесідою, зарахування за квотами-1, "
        "квотами-2 або квотами-3 (за наявності).\n"
        "   У разі відсутності з об’єктивних причин документа про здобутий освітній (освітньо-кваліфікаційний) "
        "рівень може подаватись довідка державного підприємства «Інфоресурс» про його здобуття, у тому числі без"
        " подання додатка документа про здобутий освітній (освіт- ньо-кваліфікаційний) рівень.",

        m.conditions,
        []
    ],
    "Предмети ЗНО 2020 року": [
        "<b>Предмети ЗНО 2020 року:</b>",

        m.to_conditions,
        [f"{im_fo}/презметы зно.png"]
    ],
    "Молодший бакалавр": [
        "http://vstup.onua.edu.ua/%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D1"
        "%80%D0%B8%D0%B9%D0%BE%D0%BC%D1%83-%D0%B4%D0%BE-%D0%BD%D1%83-%D0%BE%D1%8E%D0%B0-2/",

        m.to_conditions,
        []
    ],
    "Бакалавр": [
        "http://vstup.onua.edu.ua/%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D1"
        "%80%D0%B8%D0%B9%D0%BE%D0%BC%D1%83-%D0%B4%D0%BE-%D0%BD%D1%83-%D0%BE%D1%8E%D0%B0-2/",

        m.to_conditions,
        []
    ],
    "Магістр": [
        "http://vstup.onua.edu.ua/%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D1"
        "%80%D0%B8%D0%B9%D0%BE%D0%BC%D1%83-%D0%B4%D0%BE-%D0%BD%D1%83-%D0%BE%D1%8E%D0%B0-2/",

        m.to_conditions,
        []
    ]
}
