from markup_class import Markup


welcome = Markup(
    [
        "Екскурсія університетом", "Умови вступу",
        "Студенту", "Контакти"
    ]
).markup

excursion = Markup(
    [
        "Навчальні корпуси", "Знайти аудиторію",
        "Гуртожитки", "Кампус",
        "Спортивна база", "Структурні підрозділи",
        "На головну"
    ]
).markup

conditions = Markup(
    [
        "Предмети ЗНО 2020 року", "Молодший бакалавр",
        "Бакалавр", "Магістр",
        "На головну"
    ]
).markup

to_conditions = Markup(
    [
        "Умови вступу"
    ]
).markup

ed_facilities = Markup(
    [
        "Фонтанська, 23", "Академічна, 2",
        "Академічна, 5", "Академічна, 7",
        "Академічна, 9", "Рішельевська, 28",
        "Кленова, 8", "Екскурсія університетом"
    ]
).markup

to_ed_facilities = Markup(
    [
        "Навчальні корпуси"
    ]
).markup

akademichna_2 = Markup(
    [
        "МПО", "САФ",
        "ФПС", "ФППС"
    ]
).markup

akademichna_5 = Markup(
    [
        "Центр заочного навчання", "Навчальні корпуси"
    ]
).markup

akademichna_7 = Markup(
    [
        "ФЖ", "Навчальні корпуси"
    ]
).markup

akademichna_9 = Markup(
    [
        "Навчальні корпуси"
    ]
).markup

rishelevska_28 = Markup(
    [
        "СПФ", "ФА",
        "ФКІТ", "Навчальні корпуси"
    ]
).markup


dormitory = Markup(
    [
        "Гуртожиток №1", "Гуртожиток №2",
        "Гуртожиток №3", "Гуртожиток №4",
        "Гуртожиток №5", "Гуртожиток №6",
        "Гуртожиток №9", "Екскурсія університетом"
    ]
).markup

to_dormitory = Markup(
    [
        "Гуртожитки"
    ]
).markup

sport_base = Markup(
    [
        "Стадіон", "Тренажерна зала",
        "Тенісна зала", "8-ма Фонтану",
        "Екскурсія університетом", "На головну"
    ]
).markup

sport_base_back = Markup(
    [
        "Спортивна база"
    ]
).markup

mt_base = Markup(
    [
        "Музей рідкісної книги", "IT-центр",
        "Наукова бібліотека", "Тир та Музей зброї",
        "Кафе «Лекс»", "Поліграф",
        "Актова зала", "Екскурсія університетом"
    ]
).markup

to_mt_base = Markup(
    [
        "Кампус"
    ]
).markup

facilities = Markup(
    [
        "Одеса", "Киів",
        "Чернівці", "Івано-Франківськ",
        "Миколаїв", "Кривий Ріг",
        "Черкаси", "Екскурсія університетом"
    ]
).markup

to_facilities = Markup(
    [
        "Екскурсія університетом"
    ]
).markup

for_student = Markup(
    [
        "Розклад занять", "Знайти аудиторію",
        "Знайти кафедру", "На головну"
    ]
).markup

to_for_student = Markup(
    [
        "Студенту"
    ]
).markup
