from markup_class import Markup


def class_search(text):
    fontanska_23 = [
        "№102"
    ]
    akademichna_2 = [
        "№1", "№2", "№202", "№203", "№204", "№205", "№208", "№209", "№30la", "№309", "№310", "№311", "№411", "№413",
        "№415", "№511", "№512", "№513", "№602", "№603", "№607", "№607а", "№609", "№609а", "№701", "№702", "№703",
        "№704", "№706", "№708", "№708а", "№709", "№710", "№801", "№803", "№805", "№807", "№807а", "№809", "№809а",
        "№901", "№902", "№903", "№904", "№905", "№906", "№907", "№909", "№910", "№911", "№912", "№912а"
    ]
    akademichna_7 = [
        "№3"
    ]
    akademichna_7a = [
        "№4", "№5", "№6", "№9", "№11", "№12", "№13"
    ]
    akademichna_7b = [
        "№5у", "№6у", "№7у", "№8у", "№9у", "№10у"
    ]
    akademichna_9 = [
        "№7", "№8", "№10", "10а", "10б", "108в", "8а", "8б", "№14", "№16", "№25", "№26", "№29а", "№30", "№34",
        "№40", "№43", "№44", "№45", "№48", "№4П.9", "№51", "№52", "№55", "№66", "№68", "№71", "№72", "№73", "№76",
        "№77", "№79", "№80", "№81", "№83", "№84"
    ]
    klenova_8 = [
        "№22к", "№23к", "№24к", "№25к", "№26к", "№31к", "№32к", "№33к", "№34к", "№35к", "№36к"
    ]
    rishelevska_28 = [
        "№201", "№202", "№203", "№204", "№301", "№302", "№303", "№304", "№305", "№401", "№402", "№403", "№404",
        "№405", "№501", "№502", "№503", " №504", "№506", "№604", "№701", "№702", "№703", "№704", "№705", "№706",
        "№801", "№802", "№803", "№805 №901", "№902", "№903", "№904", "№905", "№906", "№1001. №1002", "№1003"
    ]
    facilities_list = [
        fontanska_23,
        akademichna_2,
        akademichna_7,
        akademichna_7a,
        akademichna_7b,
        akademichna_9,
        klenova_8,
        rishelevska_28
    ]
    facilities_address = [
        "Фонтанська дорога, 23",
        "вул. Академічна, 2",
        "вул. Академічна, 7",
        "вул. Академічна, 7a",
        "вул. Академічна, 7б",
        "вул. Академічна, 9",
        "вул. Кленова, 8",
        "вул. Рішельєвська, 28"
    ]
    addres_to_reply = []
    for facility_num in range(len(facilities_list)):
        for class_name in facilities_list[facility_num]:
            if text == class_name:
                addres_to_reply.append(facilities_address[facility_num])
    if len(addres_to_reply) == 0:
        to_send_string = f"Аудиторії {text} не існує"
    elif len(addres_to_reply) == 1:
        to_send_string = f"Аудиторія <b>{text}</b> знаходиться за адресою:\n{addres_to_reply[0]}"
    else:
        to_send_string = f"Аудиторія <b>{text}</b> знаходиться за адресами:\n" \
                         f"{' та '.join(addres_to_reply)}."
    return to_send_string


class_search_markup = Markup(
    [
        "Екскурсія університетом", "Студенту"
    ]
).markup
